jax-ws-db/src/main/resources/example/request1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="ua.kiev.unicyb.tcct">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:databaseDtoRequest>
            <gs:name>DB1</gs:name>
        </gs:databaseDtoRequest>
    </soapenv:Body>
</soapenv:Envelope>